Radiacion/Malla80x80/Case-ViewFactor-Ra10000-test4/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel  viewFactor;

viewFactorCoeffs
{
    smoothing true; //Smooth view factor matrix (use when in a close surface
                    //to force Sum(Fij = 1)
    constantEmissivity true; //constant emissivity on surfaces.
}

// Number of flow iterations per radiation iteration
solverFreq 1;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
    absorptivity    absorptivity    [0 -1 0 0 0 0 0] 0.00;
    emissivity      emissivity      [0 -1 0 0 0 0 0] 0.85;
    E               E               [1 -1 -3 0 0 0 0] 0.00;
}

scatterModel    none;

sootModel       none;

transmissivityModel none;


// ************************************************************************* //
